Autodesk.Revit.DB.IFC.IFCHybridImport.GetIFCStepIdToElementIdMap
Retrieves the association between the original IFC STEP identifiers and the created or updated Elements.
Since:
2025

Autodesk.Revit.DB.IFC.IFCHybridImport.CreateMap(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Creates a map to look up ElementIds, given an IFC GUID as input.
Remarks:
If the original IFC file contains duplicate GUIDs, only one of the
converted Elements will be registered in the map.
doc:
Document containing Elements.
elementIds:
ElementIds that are candidates for association.
Returns:
Returns map associating ElementId with a specific IFC GUID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.IFC.IFCHybridImport.UpdateElements(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.IFC.IFCHybridImportOptions)
Updates IFC Elements using AnyCAD.
doc:
Document to receive elements from the IFC file update.
file:
Full path of the file to import.
options:
The hybrid import options.
Returns:
Returns an array of ElementIds representing created or updated elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImport.ImportElements(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.IFC.IFCHybridImportOptions)
Imports IFC Elements using AnyCAD.
doc:
Document to receive elements from the IFC file import.
file:
Full path of the file to import.
options:
The hybrid import options.
Returns:
Returns an array of ElementIds representing created elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.IFC.IFCHybridImport.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCHybridImport.#ctor
Constructs a new IFCHybridImport instance for importing IFC via Hybrid method.
Since:
2024

Autodesk.Revit.DB.IFC.IFCHybridImport
Driver for Performing Hybrid Imports.
Since:
2024